---
title: AssetPropertyDistance
classe: Autodesk.Revit.DB.Visual.AssetPropertyDistance
namespace: Autodesk.Revit.DB.Visual
eredita: Autodesk.Revit.DB.Visual.AssetProperty
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# AssetPropertyDistance

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Value { get; set; }` | `assetPropertyDistance.Value` | Double |
| `ForgeTypeId GetUnitTypeId()` | `assetPropertyDistance.GetUnitTypeId()` | ForgeTypeId |
| `Boolean IsValidValue(Double)` | `assetPropertyDistance.IsValidValue(value)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```